import random

class PersianNameGenerator:
    def __init__(self):
        self.firstName = [
        "آرمان", "آرش", "آرین", "آتیلا", "آیدا", "آوا", "آرزو", "آذر", "آرینا", "آرمان",
        "باران", "بابک", "بهرام", "بهنام", "بهار", "بیتا", "برزو", "بنیامین", "بهداد", "بهرنگ",
        "پارسا", "پدرام", "پوریا", "پویا", "پگاه", "پریا", "پیمان", "پردیس", "پانیذ", "پریسا",
        "تارا", "ترانه", "تینا", "تهمینه", "توران", "تیرداد", "تینو", "تارخ", "تانیا", "تینوش",
        "جاوید", "جمشید", "جواد", "جلال", "جلیل", "جمال", "جوان", "جهان", "جوانه", "جوهر",
        "چکامه", "چهرزاد", "چاوش", "چیستا", "چمن", "چکیده", "چکاد", "چکاوک", "چلچله", "چراغ",
        "حامد", "حسام", "حسین", "حنیف", "حکیم", "حیدر", "حوری", "حنا", "حلیمه", "حسنا",
        "خسرو", "خشایار", "خلیل", "خورشید", "خاطره", "خدیجه", "خورشید", "خرم", "خاطره", "خورشید",
        "دانیال", "دارا", "داریوش", "دلارا", "دلبر", "دلناز", "دلشاد", "دلآرا", "دلارام", "دلنواز",
        "رامین", "رضا", "رهام", "راشین", "رعنا", "رؤیا", "رها", "رکسانا", "رؤیا", "رها",
        "زالا", "زهرا", "زینب", "زری", "زریا", "زهره", "زینت", "زریا", "زهرا", "زینب",
        "سارا", "سامان", "سپهر", "سپیده", "سروش", "سعید", "سلمان", "سهراب", "سوگند", "سیمین",
        "شادی", "شاهین", "شایان", "شبنم", "شهریار", "شیدا", "شهاب", "شهلا", "شیرین", "شایسته",
        "صابر", "صادق", "سپنتا", "سپند", "سپهر", "سپیده", "سپنتا", "سپند", "سپهر", "سپیده",
        "طاها", "طاهر", "طوبی", "طیبه", "طهورا", "طیار", "طیبه", "طوبی", "طاهر", "طاها",
        "عباس", "عبدالله", "علی", "عرفان", "علی", "علی", "علی", "علی", "علی", "علی",
        "فاطمه", "فرزاد", "فرزین", "فرهاد", "فرزانه", "فریبا", "فریاد", "فریبرز", "فریبا", "فریاد",
        "قاسم", "قدیر", "قدرت", "قربان", "قاسم", "قدیر", "قدرت", "قربان", "قاسم", "قدیر",
        "کامران", "کاوه", "کیان", "کیانا", "کیوان", "کامیار", "کامبیز", "کاملیا", "کامیلا", "کامران",
        "لیلا", "لاله", "لادن", "لاله", "لیلا", "لاله", "لادن", "لاله", "لیلا", "لاله",
        "مازیار", "ماهان", "ماهرخ", "ماهور", "مازیار", "ماهان", "ماهرخ", "ماهور", "مازیار", "ماهان",
        "نادر", "نازنین", "ناصر", "ناهید", "نرگس", "نسترن", "نوید", "نیما", "نیکو", "نوید",
        "وحید", "ویدا", "ویستا", "وحید", "ویدا", "ویستا", "وحید", "ویدا", "ویستا", "وحید",
        "یاسمن", "یاشار", "یاسین", "یاسمین", "یاشار", "یاسین", "یاسمین", "یاسمن", "یاشار", "یاسین",
        "زهرا", "زینب", "زهره", "زری", "زهرا", "زینب", "زهره", "زری", "زهرا", "زینب"
        ]
        self.lastName = [
        "محمدی", "رضایی", "حسینی", "کریمی", "موسوی", "جعفری", "قاسمی", "مرادی", "اکبری", "رحیمی",
        "کاظمی", "احمدی", "صالحی", "نوری", "فرهادی", "سلطانی", "شریفی", "امیری", "بهرامی", "عباسی",
        "زارعی", "سلیمانی", "مهدوی", "نظری", "پورمحمد", "پارسا", "رحمانی", "غلامی", "یزدی", "علیزاده",
        "طاهری", "میرزایی", "ناصری", "حیدری", "خلیلی", "شاهینی", "میرزایی", "فاطمی", "شعبانی", "قربانی",
        "محمدپور", "رستمی", "سعیدی", "میرزایی", "حسنی", "نعمتی", "کرمی", "محمدی", "رضایی", "حسینی",
        "کریمی", "موسوی", "جعفری", "قاسمی", "مرادی", "اکبری", "رحیمی", "کاظمی", "احمدی", "صالحی",
        "نوری", "فرهادی", "سلطانی", "شریفی", "امیری", "بهرامی", "عباسی", "زارعی", "سلیمانی", "مهدوی",
        "نظری", "پورمحمد", "پارسا", "رحمانی", "غلامی", "یزدی", "علیزاده", "طاهری", "میرزایی", "ناصری",
        "حیدری", "خلیلی", "شاهینی", "میرزایی", "فاطمی", "شعبانی", "قربانی", "محمدپور", "رستمی", "سعیدی",
        "میرزایی", "حسنی", "نعمتی", "کرمی", "محمدی", "رضایی", "حسینی", "کریمی", "موسوی", "جعفری",
        "قاسمی", "مرادی", "اکبری", "رحیمی", "کاظمی", "احمدی", "صالحی", "نوری", "فرهادی", "سلطانی",
        "شریفی", "امیری", "بهرامی", "عباسی", "زارعی", "سلیمانی", "مهدوی", "نظری", "پورمحمد", "پارسا",
        "رحمانی", "غلامی", "یزدی", "علیزاده", "طاهری", "میرزایی", "ناصری", "حیدری", "خلیلی", "شاهینی",
        "میرزایی", "فاطمی", "شعبانی", "قربانی", "محمدپور", "رستمی", "سعیدی", "میرزایی", "حسنی", "نعمتی",
        "کرمی", "محمدی", "رضایی", "حسینی", "کریمی", "موسوی", "جعفری", "قاسمی", "مرادی", "اکبری",
        "رحیمی", "کاظمی", "احمدی", "صالحی", "نوری", "فرهادی", "سلطانی", "شریفی", "امیری", "بهرامی",
        "عباسی", "زارعی", "سلیمانی", "مهدوی", "نظری", "پورمحمد", "پارسا", "رحمانی", "غلامی", "یزدی",
        "علیزاده", "طاهری", "میرزایی", "ناصری", "حیدری", "خلیلی", "شاهینی", "میرزایی", "فاطمی", "شعبانی",
        "قربانی", "محمدپور", "رستمی", "سعیدی", "میرزایی", "حسنی", "نعمتی", "کرمی"
        ]
        
    def getFirstName(self) :
        return  random.choice(self.firstName)
    
    def getLastName(self) :
        return  random.choice(self.lastName)
    
    def getFullName(self) :
        firstName = random.choice(self.firstName)
        lastName =random.choice(self.lastName)
        fullName = firstName + " " + lastName
        return fullName